@echo off
chcp 65001 > nul
title Спортивный Комплекс - Сервер
echo ===================================================
echo   Запуск веб-приложения Спортивный Комплекс
echo ===================================================
echo.

:: 1. Инициализация базы данных (если не инициализирована)
"C:\Program Files\Python313\python.exe" init_db.py

:: 2. Открытие сайта в браузере по умолчанию
start http://127.0.0.1:5000/

:: 3. Запуск веб-сервера Flask
"C:\Program Files\Python313\python.exe" app.py

pause